const months = [
  "января",
  "февраля",
  "марта",
  "апреля",
  "мая",
  "июня",
  "июля",
  "августа",
  "сентября",
  "октября",
  "ноября",
  "декабря"
];
const jMonths = [
  "いちがつ",
  "にがつ",
  "さんがつ",
  "しがつ",
  "ごがつ",
  "ろくがつ",
  "しちがつ",
  "はちがつ",
  "くがつ",
  "じゅうがつ",
  "じゅういちがつ",
  "じゅうにがつ"
];
const jDay = {
  1: "ついたち",
  2: "ふつか",
  3: "みっか",
  4: "よっか",
  5: "いつか",
  6: "むいか",
  7: "むいか",
  8: "ようか",
  9: "ここのか",
  10: "とおか",
  11: "じゅういちにち",
  12: "じゅうににち",
  13: "じゅうさんにち",
  14: "じゅうよっか",
  15: "じゅうごにち",
  16: "じゅうろくにち",
  17: "じゅうななにち",
  18: "じゅうはちにち",
  19: "じゅうきゅうにち",
  20: "はつか",
  21: "にじゅういちにち",
  22: "にじゅうににち",
  23: "にじゅうさんにち",
  24: "はつか",
  25: "にじゅうごにち",
  26: "にじゅうろくにち",
  27: "にじゅうななにち",
  28: "にじゅうはちにち",
  29: "にじゅうきゅうにち",
  30: "さんじゅうにち",
  31: "さんじゅういちにち"
};

export default {
  months,
  jMonths,
  jDay
};
